app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]
---
  def index
    @categories = Category.where(user: current_user)

INSERT INTO "categories" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @category = Category.new(category_params)
    @category.user = current_user

    respond_to do |format|
      if @category.save