app/controllers/transacs_controller.rb

SELECT "transacs".* FROM "transacs" WHERE "transacs"."user_id" = $1  [["user_id", 1]]
---
  def index
    @transacs = Transac.where(user: current_user)

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]
---
  def new
    @transac = Transac.new
    @categories = Category.where(user: current_user)

INSERT INTO "transacs" ("name", "amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Momo"], ["amount", "70.0"], ["user_id", 1], ["created_at", "2022-08-13 21:42:56.720462"], ["updated_at", "2022-08-13 21:42:56.720462"]]
INSERT INTO "transacs" ("name", "amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Momo"], ["amount", "20000.0"], ["user_id", 1], ["created_at", "2022-08-13 11:29:32.877048"], ["updated_at", "2022-08-13 11:29:32.877048"]]
---
  def create
    @transac = Transac.new(transac_params)

    @transac.user = current_user
    @transac.save
    create_categ_transacs unless params[:categories].blank?

    respond_to do |format|
      if @transac.save

SELECT "transacs".* FROM "transacs" WHERE "transacs"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def set_transac
    @transac = Transac.find(params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create_categ_transacs
    params[:categories].each do |k, _v|
      CategoriesTransac.create(category: Category.find(k), transac: @transacs)